app/controllers/banquets_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]
SELECT "banquets".* FROM "banquets" WHERE "banquets"."zip_code" = ?  [["zip_code", 12345]]
---
  def find
    if(session[:user_id])
      user = User.find(session[:user_id])
      zip = user.zip_code
      @banquets = Banquet.where(:zip_code => zip)

SELECT "banquets".* FROM "banquets" WHERE "banquets"."hostID" = ?  [["hostID", 7]]
---
  def show
    if(session[:user_id])
      @banquets = Banquet.where(:hostID => session[:user_id])

INSERT INTO "banquets" ("hostID", "banquet_name", "zip_code", "start", "end", "entryPrice", "entryLimit") VALUES (?, ?, ?, ?, ?, ?, ?)  [["hostID", 2], ["banquet_name", "Backyard BBQ"], ["zip_code", 34067], ["start", "2019-12-03 10:00:00.000000"], ["end", "2019-12-03 14:00:00.000000"], ["entryPrice", 5.5], ["entryLimit", 50]]
---
  def create
    if(session[:user_id])
      Banquet.create!(:hostID => session[:user_id], :banquet_name => params[:banquet][:name], :zip_code => params[:banquet][:zip_code], :start => params[:banquet][:start], :end => params[:banquet][:end], :entryPrice => params[:banquet][:entryPrice], :entryLimit => params[:banquet][:entryLimit])