app/controllers/events_controller.rb

SELECT "events".* FROM "events"
SELECT  "aggregates".* FROM "aggregates" WHERE "aggregates"."id" = ? LIMIT 1  [["id", 9]]
---
  def index
    @events = Event.all
    @events.each do |event|
      agg = Aggregate.find(event[:aggregate_id])