app/controllers/transactions_controller.rb

  def show
    if(session[:user_id])
      user_id = session[:user_id]

      @debits = Transaction.where(:fromID => user_id)
      @debits.each do |debit|
        debit.banquet_name = Banquet.find(debit.banquetID).banquet_name
        debit.customer_email = User.find(user_id).email
        debit.recipient_email = User.find(debit.toID).email
      end

      @credits = Transaction.where(:toID => user_id)
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."fromID" = 11
SELECT  "banquets".* FROM "banquets" WHERE "banquets"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 11]]
SELECT "transactions".* FROM "transactions" WHERE "transactions"."toID" = 11

  def create
    if(session[:user_id])
      banquet = Banquet.find(params[:id])
      Transaction.create!(:fromID => session[:user_id], :toID => banquet[:hostID], :banquetID => banquet[:id], :amount => banquet[:entryPrice])
---
SELECT  "banquets".* FROM "banquets" WHERE "banquets"."id" = ? LIMIT 1  [["id", 3]]
INSERT INTO "transactions" ("fromID", "toID", "banquetID", "amount") VALUES (?, ?, ?, ?)  [["fromID", 1], ["toID", 2], ["banquetID", 3], ["amount", 6.49]]