app/controllers/users_controller.rb

  def verify
    users = User.where(email: params[:user][:login_email])
    if(users.length < 1)
---
SELECT "users".* FROM "users" WHERE "users"."email" = ?  [["email", "joemama@gmail.com"]]
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1

  def create
    if(User.find_by(email: params[:user][:signup_email]))
      flash[:notice] = "A profile already exists with that email address"
      redirect_to login_path
    else
      @user = User.create!(:email => params[:user][:signup_email], :password => params[:user][:signup_password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "lkjbsfvjh"]]
INSERT INTO "users" ("email", "password") VALUES (?, ?)  [["email", "lkjbsfvjh"], ["password", "kjbnsfdv"]]

  def edit
    if(session[:user_id])
      @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", nil]]

  def update
    if(session[:user_id])
      @user = User.find(session[:user_id])
      @user.update_attributes!(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 11]]
UPDATE "users" SET "first_name" = ?, "middle_name" = ?, "last_name" = ?, "zip_code" = ? WHERE "users"."id" = ?  [["first_name", "Joekjhv"], ["middle_name", "Faljbh"], ["last_name", "Mamakjhv"], ["zip_code", 76500], ["id", 1]]